## Main Question
We will predict sales for the thousands of product families sold at Favorita stores located in Ecuador.

### Data Understanding
The training data includes dates, store and product information, whether that item was being promoted, as well as the sales numbers.  
Additional files include supplementary information that may be useful in building your models.

### Exploratory Data Analysis

In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv("Datasets/Ecuador_sales_record_train.csv")

In [ ]:
dataset.head()

,id,date,store_nbr,family,sales,onpromotion
3000883,3000883,2017-08-15,9,POULTRY,438.133,0
3000884,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
3000885,3000885,2017-08-15,9,PRODUCE,2419.729,148
3000886,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
3000887,3000887,2017-08-15,9,SEAFOOD,16.000,0